Revit 2024 API
EffectInstance.SetSpecularColor Method
 Sets the specular color parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetSpecularColor(
	Color color
)
Visual Basic
Public Sub SetSpecularColor ( _
	color As Color _
)
Visual C++
public:
void SetSpecularColor(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
 The specular color value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace